clear;
%相关参数导入
m=3880; 
Iw1=1.798; Iw2=3.598; Iw=Iw1+Iw2;
If=0.218; 
G=9.8*3880;
f=0.013; 
i0=5.83; 
CdA=2.77; 
r=0.367; 
yita=0.85; 
ig=[5.56 2.769 1.644 1.00 0.793];
pg=8;
delta=1+Iw/(m*r^2)+If*ig.^2*i0^2*yita/(m*r^2); 

n0=[815 1207 1614 2012 2603 3006 3403 3804];
B0=[1326.8 1354.7 1284.4 1122.9 1141.0 1051.2 1233.9 112.7];
B1=[-416.46 -303.98 -189.75 -121.59 -98.893 -73.714 -84.478 -45.291];
B2=[72.379 36.657 14.524 7.0035 4.4763 2.8593 2.9788 0.71113];
B3=[-5.8629 -2.0553 -0.51184 -0.18517 -0.091077 -0.05138 -0.047449 -0.00075215];
B4=[0.17768 0.043072 0.0068164 0.0018555 0.00068906 0.00035032 0.00028230 -0.000038568];

%形成8个转速下，不同档位下车速u和b的对应矩阵
for j=1:5
    for i=1:8
        Tq(i)=-19.313+295.27*n0(i)/1000-165.44*(n0(i)/1000).^2+40.874*(n0(i)/1000).^3-3.8445*(n0(i)/1000).^4;
        u_b(j,i)=0.377*r*n0(i)/ig(j)/i0;
        Peb(i)=Tq(i)*n0(i)/9550;
        b(i)=B0(i)+B1(i)*Peb(i)+B2(i)*Peb(i)^2+B3(i)*Peb(i)^3+B4(i)*Peb(i)^4;
    end
end

%为了低速时b可以通过线性插值法获得，启动时车速为0时对应的b=0，矩阵第一列补0
colum=[0;0;0;0;0];
u_b=[colum u_b];
b=[0 b];

%工况1，Ⅱ档起步加速时燃料消耗量（mL）
Q1_1=0;
a1=(7/3.6)^2/(2*5.5);
t1_1=1/(3.6*a1);

for i=1:7
 u1(1)=0;
 u1(i+1)=u1(i)+ 1;
 P1(i)=(G*f* u1(i)/3600+CdA*u1(i)^3/76140+delta(2)*m*u1(i)*a1/3600)/yita;
 P1(i+1)=(G*f*u1(i+1)/3600+CdA*u1(i+1)^3/76140+delta(2)*m*u1(i+1)*a1/3600)/yita;
 b1(i)=interp1(u_b(2,:),b,u1(i));    %线性插值
 b1(i+1)=interp1(u_b(2,:),b,u1(i+1));
 Q1t(i)=P1(i)*b1(i)/(367.1*pg);
 Q1t(i+1)=P1(i+1)*b1(i+1)/(367.1*pg);
 Q11(i)=(Q1t(i)+Q1t(i+1))*t1_1/2;
 Q1_1=Q1_1+Q11(i);
end

%工况1，Ⅲ档加速时燃料消耗量（mL）
Q1_2=0;
a2=((14/3.6)^2-(7/3.6)^2)/(2*24.5);
t1_2=1/(3.6*a2);

for i=1:7
 u2(1)=7;
 u2(i+1)=u2(i)+ 1;
 P2(i)=(G*f* u2(i)/3600+CdA*u2(i)^3/76140+delta(3)*m*u2(i)*a2/3600)/yita;
 P2(i+1)=(G*f*u2(i+1)/3600+CdA*u2(i+1)^3/76140+delta(3)*m*u2(i+1)*a2/3600)/yita;
 b2(i)=interp1(u_b(3,:),b,u2(i));
 b2(i+1)=interp1(u_b(3,:),b,u2(i+1));
 Q2t(i)=P2(i)*b2(i)/(367.1*pg);
 Q2t(i+1)=P2(i+1)*b2(i+1)/(367.1*pg);
 Q22(i)=(Q2t(i)+Q2t(i+1))*t1_2/2;
 Q1_2=Q1_2+Q22(i);
end

%工况1，Ⅳ档加速时燃料消耗量（mL）
Q1_3=0;
a3=((20/3.6)^2-(14/3.6)^2)/(2*50);
t1_3=1/(3.6*a3);

for i=1:6
 u3(1)=14;
 u3(i+1)=u3(i)+ 1;
 P3(i)=(G*f* u3(i)/3600+CdA*u3(i)^3/76140+delta(4)*m*u3(i)*a3/3600)/yita;
 P3(i+1)=(G*f*u3(i+1)/3600+CdA*u3(i+1)^3/76140+delta(4)*m*u3(i+1)*a3/3600)/yita;
 b3(i)=interp1(u_b(4,:),b,u3(i));
 b3(i+1)=interp1(u_b(4,:),b,u3(i+1));
 Q3t(i)=P3(i)*b3(i)/(367.1*pg);
 Q3t(i+1)=P3(i+1)*b3(i+1)/(367.1*pg);
 Q33(i)=(Q3t(i)+Q3t(i+1))*t1_3/2;
 Q1_3=Q1_3+Q33(i);
end

%工况1，Ⅴ档加速时燃料消耗量（mL）
Q1_4=0;
a4=((25/3.6)^2-(20/3.6)^2)/(2*70);
t1_4=1/(3.6*a4);

for i=1:5
 u4(1)=20;
 u4(i+1)=u4(i)+ 1;
 P4(i)=(G*f* u4(i)/3600+CdA*u4(i)^3/76140+delta(5)*m*u4(i)*a4/3600)/yita;
 P4(i+1)=(G*f*u4(i+1)/3600+CdA*u4(i+1)^3/76140+delta(5)*m*u4(i+1)*a4/3600)/yita;
 b4(i)=interp1(u_b(5,:),b,u4(i));
 b4(i+1)=interp1(u_b(5,:),b,u4(i+1));
 Q4t(i)=P4(i)*b4(i)/(367.1*pg);
 Q4t(i+1)=P4(i+1)*b4(i+1)/(367.1*pg);
 Q44(i)=(Q4t(i)+Q4t(i+1))*t1_4/2;
 Q1_4=Q1_4+Q44(i);
end

%工况1，总燃料消耗量（mL）
Q1=Q1_1+Q1_2+Q1_3+Q1_4;

%工况2，u=25km/h匀速行驶时燃料消耗量（mL）
u5=25;
P5=(G*f* u5/3600+CdA*u5^3/76140)/yita;
b5=interp1(u_b(5,:),b,u5);
Q2=P5*120*b5/(102*u5*pg); 

%工况3，Ⅴ档加速时燃料消耗量（mL）
Q3=0;
a6=((40/3.6)^2-(25/3.6)^2)/(2*160);
t6=1/(3.6*a6);

for i=1:15
 u6(1)=25;
 u6(i+1)=u6(i)+ 1;
 P6(i)=(G*f* u6(i)/3600+CdA*u6(i)^3/76140+delta(5)*m*u6(i)*a6/3600)/yita;
 P6(i+1)=(G*f*u6(i+1)/3600+CdA*u6(i+1)^3/76140+delta(5)*m*u6(i+1)*a6/3600)/yita;
 b6(i)=interp1(u_b(5,:),b,u6(i));
 b6(i+1)=interp1(u_b(5,:),b,u6(i+1));
 Q6t(i)=P6(i)*b6(i)/(367.1*pg);
 Q6t(i+1)=P6(i+1)*b6(i+1)/(367.1*pg);
 Q66(i)=(Q6t(i)+Q6t(i+1))*t6/2;
 Q3=Q3+Q66(i);
end

%工况4，车辆减速，发动机怠速时燃料消耗量（ml）
Qid=0.299;
Q4=Qid*(2*270/(40/3.6));

%整个循环工况的百公里燃料消耗量（L/100km）
Qs=(Q1+Q2+Q3+Q4)/700*100;

disp(['Q1(工况1燃料消耗量（mL））=' num2str(Q1)]);
disp(['Q2(工况2燃料消耗量（mL））=' num2str(Q2)]);
disp(['Q3(工况3燃料消耗量（mL））=' num2str(Q3)]);
disp(['Q4(工况4燃料消耗量（mL））=' num2str(Q4)]);
disp(['Qs(整个循环工况的百公里燃料消耗量（L/100km））=' num2str(Qs)]);



